AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИсточникиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсточникиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПесочницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияTInvestAPI/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция TInvest_ПолучитьОперации(AccountId, ДатаС, ДатаПо, Состояние = "OPERATION_STATE_EXECUTED", FIGI = "", Песочница = Ложь)
// Получает список операций по счёту за период через метод GetOperations.
// Параметры:
// AccountId -- идентификатор счёта
// ДатаС -- начало периода
// ДатаПо -- конец периода
// Состояние -- фильтр по состоянию операции
// FIGI -- фильтр по инструменту
// Песочница -- использовать sandbox API
// Возвращаемое значение:
// Ответ API T-Invest по методу GetOperations.
// Особенности:
// выполняется проверка обязательных параметров
// даты передаются в ISO-формате
Функция TInvest_ПолучитьОперации(AccountId, ДатаС, ДатаПо, 
	Состояние = "OPERATION_STATE_EXECUTED", FIGI = "", Песочница = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(AccountId) Тогда
		ВызватьИсключение "Не задан accountId";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаС) Или НЕ ЗначениеЗаполнено(ДатаПо) Тогда
		ВызватьИсключение "Не задан период (ДатаС/ДатаПо)";
	КонецЕсли;
	
	// Важно: API ожидает date-time в UTC строкой.
	// Здесь я даю простой формат ISO без миллисекунд.
	// Если у тебя даты уже локальные (через XMLЗначение), то это “локальный момент”, но строка будет без 'Z'.
	// Для MVP обычно достаточно: API принимает date-time строку, в документации указано UTC. :contentReference[oaicite:7]{index=7}
	Тело = Новый Структура;
	Тело.Вставить("accountId", AccountId);
	Тело.Вставить("from", Формат(ДатаС, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
	Тело.Вставить("to",   Формат(ДатаПо, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
	
	Если ЗначениеЗаполнено(Состояние) Тогда
		Тело.Вставить("state", Состояние);
	КонецЕсли;
	Если ЗначениеЗаполнено(FIGI) Тогда
		Тело.Вставить("figi", FIGI);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура("Тело", Тело);
	
	Возврат TInvest_ВыполнитьЗапрос("POST",
		"OperationsService",
		"GetOperations",
		ПараметрыЗапроса,
		Песочница);
		
КонецФункции

// Функция TInvest_ПолучитьОперацииПоКурсору(AccountId, ДатаС, ДатаПо, 
//   Лимит = 1000, Состояние = "OPERATION_STATE_EXECUTED", 
//   InstrumentId = "", Песочница = Ложь) Экспорт
// Получает операции по счёту за период через cursor-based API GetOperationsByCursor с автоматической выборкой всех страниц.
// Параметры:
// AccountId -- идентификатор счёта
// ДатаС -- начало периода
// ДатаПо -- конец периода
// Лимит -- размер страницы
// Состояние -- фильтр по состоянию
// InstrumentId -- фильтр по инструменту
// Песочница -- использовать sandbox API
// Возвращаемое значение:
// Массив операций, собранный из всех страниц ответа.
// Особенности:
// автоматически обрабатывает nextCursor / hasNext
// возвращает плоский массив операций
// поддерживает несколько вариантов структуры ответа (items, operations)
Функция TInvest_ПолучитьОперацииПоКурсору(AccountId, ДатаС, ДатаПо, 
	Лимит = 1000, Состояние = "OPERATION_STATE_EXECUTED", 
	InstrumentId = "", Песочница = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(AccountId) Тогда
		ВызватьИсключение "Не задан accountId";
	КонецЕсли;
	
	Если Лимит <= 0 Тогда
		Лимит = 100;
	ИначеЕсли Лимит > 1000 Тогда
		Лимит = 1000;
	КонецЕсли;
	
	Результат = Новый Массив;
	Курсор = "";
	
	Пока Истина Цикл
		
		Тело = Новый Структура;
		Тело.Вставить("accountId", AccountId);
		Тело.Вставить("from", Формат(ДатаС, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
		Тело.Вставить("to",   Формат(ДатаПо, "ДФ=yyyy-MM-dd'T'HH:mm:ss'Z'"));
		Тело.Вставить("limit", Лимит);
		
		Если ЗначениеЗаполнено(Состояние) Тогда
			Тело.Вставить("state", Состояние);
		КонецЕсли;
		
		// instrumentId может быть UID или FIGI (по доке) :contentReference[oaicite:9]{index=9}
		Если ЗначениеЗаполнено(InstrumentId) Тогда
			Тело.Вставить("instrumentId", InstrumentId);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Курсор) Тогда
			Тело.Вставить("cursor", Курсор);
		КонецЕсли;
		
		ПараметрыЗапроса = Новый Структура("Тело", Тело);
		Ответ = TInvest_ВыполнитьЗапрос("POST",
			"OperationsService",
			"GetOperationsByCursor",
			ПараметрыЗапроса,
			Песочница);
		
		Если Ответ = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		// В ответе: items/elements + nextCursor/hasNext (зависит от схемы)
		// По доке это cursor-ответ, так что ориентируйся на свойства курсора.
		Если Ответ.Свойство("items") Тогда
			Для Каждого Операция Из Ответ.items Цикл
				Результат.Добавить(Операция);
			КонецЦикла;
		ИначеЕсли Ответ.Свойство("operations") Тогда
			Для Каждого Операция Из Ответ.operations Цикл
				Результат.Добавить(Операция);
			КонецЦикла;
		КонецЕсли;
		
		ЕстьСледующий = Ложь;
		Если Ответ.Свойство("hasNext") Тогда
			ЕстьСледующий = Ответ.hasNext;
		КонецЕсли;
		
		Если Ответ.Свойство("nextCursor") Тогда
			Курсор = Ответ.nextCursor;
		ИначеЕсли Ответ.Свойство("cursor") Тогда
			// иногда возвращают просто cursor
			Курсор = Ответ.cursor;
		Иначе
			Курсор = "";
		КонецЕсли;
		
		Если НЕ ЕстьСледующий Или НЕ ЗначениеЗаполнено(Курсор) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция TInvest_ПолучитьСчетаПользователя
// 
Функция TInvest_ПолучитьСчетаПользователя() Экспорт
	
	Тело = Новый Структура;
	Тело.Вставить("status", "ACCOUNT_STATUS_UNSPECIFIED");
	ТелоJSON = ОбщегоНазначения.ЗначениеВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ОтветСервиса = TInvest_ВыполнитьЗапрос("POST", "UsersService", "GetAccounts", ПараметрыЗапроса);
	
	Если Не ОтветСервиса.Свойство("accounts") Тогда
		Сообщить("Нет данных");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОтветСервиса.accounts;
	
КонецФункции

// Функция TInvest_ПолучитьПортфельПоСчету
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция TInvest_ПолучитьПортфельПоСчету(Счет, currency = "RUB", ПрочитатьГотовыеДанные = Ложь) Экспорт

	Если ТипЗнч(Счет) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		AccountId = Счет.AccountId;
		СчетСсылка = Счет.Ссылка;
	ИначеЕсли ТипЗнч(Счет) = Тип("Строка") Тогда
		AccountId = Счет;
		СчетСсылка = Справочники.Счета.НайтиПоРеквизиту("AccountId", AccountId);
	ИначеЕсли ТипЗнч(Счет) = Тип("СправочникСсылка.Счета") Тогда
		AccountId = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "AccountId");
		СчетСсылка = Счет;
	Иначе
		ВызватьИсключение "неизвестный тип данных в процедуре ПортфельПоСчету - " + ТипЗнч(Счет);
	КонецЕсли;
	Тело = Новый Структура;
	Тело.Вставить("accountId", AccountId);
	Тело.Вставить("currency", currency);
	ТелоJSON = ОбщегоНазначения.ЗначениеВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);
	
	Если ПрочитатьГотовыеДанные Тогда
		ДанныеСервиса = ИнтеграцияTInvestСлужебный.ПрочитатьЗаписатьВременноеХранениеДанных(, ПрочитатьГотовыеДанные);
	Иначе
		ДанныеСервиса = TInvest_ВыполнитьЗапрос("POST", "OperationsService", "GetPortfolio", ПараметрыЗапроса);
		ИнтеграцияTInvestСлужебный.ПрочитатьЗаписатьВременноеХранениеДанных(, ПрочитатьГотовыеДанные);
	КонецЕсли;

	Если Не ДанныеСервиса.Свойство("positions") Тогда
		Сообщить("Нет данных");
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеСервиса.Вставить("СчетСсылка", СчетСсылка);
	
	Возврат ДанныеСервиса;

КонецФункции // TInvest_ПолучитьПортфельПоСчету()

// ПолучитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей)
// Получает последние цены по инструментам через метод GetLastPrices и записывает их в регистр сведений ТекущиеЦены.
// Параметры:
// Инструменты -- таблица значений с колонкой UID; если не задана, список инструментов определяется по текущим остаткам регистра ПозицииИнструментов
// КоличествоЗаписей -- выходной параметр, количество записанных цен
// Результат:
// выполняется запись данных в регистр ТекущиеЦены
// Особенности:
// отбираются только инструменты с заполненным UID
// инструмент сопоставляется по UID
// если инструмент не найден, выводится сообщение пользователю
Функция ПолучитьПоследниеЦеныПоИнструментам(Знач Инструменты = Неопределено, КоличествоЗаписей) Экспорт
	
	Если ЗначениеЗаполнено(Инструменты) Тогда
		МассивИдентификаторовИнструментов = Инструменты.ВыгрузитьКолонку("UID");
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Инструменты.UID КАК UID,
			|	Инструменты.Ссылка КАК Ссылка
			|ИЗ
			|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Инструменты КАК Инструменты
			|		ПО ПозицииИнструментовОстатки.Инструмент = Инструменты.Ссылка
			|ГДЕ
			|	Инструменты.UID <> """"";
		
		Инструменты = Запрос.Выполнить().Выгрузить();
		МассивИдентификаторовИнструментов = Инструменты.ВыгрузитьКолонку("UID");
		
	КонецЕсли;
	
	Тело = Новый Структура;
	Тело.Вставить("instrumentId", МассивИдентификаторовИнструментов);
	ТелоJSON = ОбщегоНазначения.ЗначениеВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);

	ЦеныПоИнструментам = TInvest_ВыполнитьЗапрос("POST", "MarketDataService", "GetLastPrices", ПараметрыЗапроса);
	
	Если Не ЦеныПоИнструментам.Свойство("lastPrices") Тогда
		Сообщить("Нет данных");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЦеныПоИнструментам.lastPrices;

КонецФункции

Функция TInvest_ОсновнаяИнформацияОбИнструменте(СтрокаПоиска, КлассКод = "INSTRUMENT_TYPE_UNSPECIFIED", idType = "INSTRUMENT_ID_TYPE_TICKER", 
	ТолькоТоргуемые = Истина, Песочница = Ложь) Экспорт
	
	// Тело запроса
	Тело = Новый Структура;
	Тело.Вставить("id_type", idType);
	Тело.Вставить("class_code", КлассКод);
	Тело.Вставить("id", СтрокаПоиска);
	ТелоJSON = ОбщегоНазначения.ЗначениеВJSON(Тело);
	ПараметрыЗапроса = Новый Структура("Тело", ТелоJSON);
	Данные = TInvest_ВыполнитьЗапрос("POST", "InstrumentsService", "GetInstrumentBy", ПараметрыЗапроса, Ложь);
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСвечи(ИдентификаторИнструмента, ДатаНачала, ДатаОкончания, ИнтервалAPI) Экспорт
    
    ТелоЗапроса = Новый Структура;
    ТелоЗапроса.Вставить("instrumentId", ИдентификаторИнструмента);
    ТелоЗапроса.Вставить("from", ИнтеграцияTInvestСлужебный.ПреобразоватьДатуВСтроку(ДатаНачала));
    ТелоЗапроса.Вставить("to", ИнтеграцияTInvestСлужебный.ПреобразоватьДатуВСтроку(ДатаОкончания));
    ТелоЗапроса.Вставить("interval", ИнтервалAPI);
	
	ПараметрыЗапроса = Новый Структура("Тело", ТелоЗапроса);
	
    ОтветJSON = TInvest_ВыполнитьЗапрос(,"MarketDataService", "GetCandles", ПараметрыЗапроса);
    
    Если ОтветJSON = Неопределено Тогда
        Возврат Новый Массив;
    КонецЕсли;
    
    // Ожидаем, что в ответе есть candles
    Если Не ОтветJSON.Свойство("candles") Тогда
        Возврат Новый Массив;
    КонецЕсли;
    
    Возврат ОтветJSON.candles;
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция TInvest_ВыполнитьЗапрос(Метод = "POST", РазделAPI, ИмяКоманды, ПараметрыЗапроса, Песочница = Ложь)
	
	РеквизитыИсточникаДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Справочники.ИсточникиДанных.ТИнвест, "Адрес, Путь, Порт");
	
	Если ПараметрыЗапроса.Свойство("Токен") И ЗначениеЗаполнено(ПараметрыЗапроса.Токен) Тогда
		Токен = ПараметрыЗапроса.Токен;
	Иначе
		Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.ИсточникиДанных");
		ИмяСервиса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ИсточникиДанных.ТИнвест, "Наименование");
		Токен = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, ИмяСервиса);
	КонецЕсли;
	
	// Host для REST-прокси
	Хост = ?(Песочница, "sandbox-invest-public-api.tbank.ru", РеквизитыИсточникаДанных.Адрес);
	Порт = РеквизитыИсточникаДанных.Порт;

	// Путь метода (REST proxy)
	Путь = РеквизитыИсточникаДанных.Путь + "." + РазделAPI + "/" + ИмяКоманды;

	// Тело запроса
	Тело = Неопределено;
	Если ПараметрыЗапроса.Свойство("Тело", Тело) Тогда
		Если ТипЗнч(Тело) = Тип("Строка") Тогда
			ТелоJSON = Тело;
		ИначеЕсли ТипЗнч(Тело) = Тип("Структура") Или ТипЗнч(Тело) = Тип("Массив") Тогда
			ТелоJSON = ОбщегоНазначения.ЗначениеВJSON(Тело);
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не тот тип параметра запроса 'Тело': " + ТипЗнч(Тело));
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не передан параметр запроса 'Тело'");
		Возврат Неопределено;
	КонецЕсли;
	
	// HTTPS соединение
	// В большинстве окружений хватит простого HTTPСоединение по 443.
	Таймаут = 10;
	
	НастройкиПрокси = Новый ИнтернетПрокси(Ложь);
	НастройкиПрокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
	НастройкиПрокси.НеИспользоватьПроксиДляАдресов.Добавить("127.0.0.0");
	
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);
	
	Соединение = Новый HTTPСоединение(Хост, 443,,, НастройкиПрокси, 1, Истина);
	
	Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("Accept", "application/json");

	Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);

	Если Ответ.КодСостояния <> 200 Тогда
		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
		Если Ответ.КодСостояния = 404 Тогда
			Результат = Новый Структура("Ошибка, ОписаниеОшибки", Истина, ТекстОшибки);
		Иначе
			// Для отладки удобно вернуть текст ошибки
			ВызватьИсключение СтрШаблон("Сервис T-Invest при обращении к методу %3 сообщил об ошибке: %1. 
							|%2
							|Тело: %4", Ответ.КодСостояния, ТекстОшибки, ИмяКоманды, ТелоJSON);
		КонецЕсли;
	КонецЕсли;

	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Результат = ОбщегоНазначения.JSONВЗначение(ТекстОтвета,, Ложь);

	// Обычно в ответе массив инструментов. Конкретное имя поля зависит от схемы ответа в Swagger.
	// Поэтому возвращаем весь разобранный объект, а дальше ты уже выберешь нужное (figi/uid/ticker).
	Возврат Результат;

КонецФункции

#КонецОбласти
